Revit 2027 API
ParameterTypeId.SweepMaxSegAngle Property
 "Maximum Segment Angle"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SweepMaxSegAngle { get; }
Public Shared ReadOnly Property SweepMaxSegAngle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SweepMaxSegAngle {
	ForgeTypeId^ get ();
}
static member SweepMaxSegAngle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace